//--------------------------------------------------------------------
//  Windows Socket Programing ( NetWork Programing) 
//--------------------------------------------------------------------
// ex) 게임서버, 일반적인 윈도우즈 네트워크, 실시간 스트리밍  
//--------------------------------------------------------------------
//ws2_32.lib :  Winsock Lib 추가 !! 
//--------------------------------------------------------------------

#include <winsock2.h> //  winsock2헤더파일 추가 !! 
#include <stdio.h> 

void main()
{	
	WSADATA wsa; // 소켓 버전 정보 구조체 !! 
	// 1) Windows DLL파일을 로딩 !!

	if( WSAStartup( MAKEWORD(2,2) , &wsa) != 0) 
	{
		puts("실패 !!");return;  
	}
	//-------------------------------------------------------------------
	printf("윈속 초기화 !! "); 
	printf("버전 : %d 설명 : %s 최대 소켓수: %d\n", 
			 wsa.wVersion, wsa.szDescription, wsa.iMaxSockets); 


		
	//-------------------------------------------------------------------
	WSACleanup(); //  DLL 언로딩 !!


}